ХМНПФ_Общее/AccumulationRegisters/уп_НачисленияПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачисленияПенсий</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВПериоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерваНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ВозвратПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВозвратПенсий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_ВозвратСПлатежногоПоручения</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_ПричинаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.хм_ПричиныВозвратовПенсий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьЗадолженость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьРКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НекорректныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументВыплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыОперацийВозвратПенсий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛНеУдержанВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СчетДоговора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаКонцаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачалаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументВыплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/хм_МеханизмыСверкиСерверПереопределяемый/Ext/Module.bsl
//СтрокаПравилСервер

Процедура KU_ДолгПоНачислениям_ЗагрузитьВРегистр(ДеревоНаСервере,ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	ДокументКомментарий ="Долги по начислениям Каспер";

	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");
	
	Для каждого ВыборкаПериод Из ДеревоНаСервере.Строки Цикл
		
		Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
			ОперацияНПО = Документы.уп_ОперацияНПО.СоздатьДокумент();
		    ОперацияНПО.ВидРучнойОперации=Справочники.уп_ВидыРучныхОперацийНПФ.НайтиПоКоду("000000023"); 
			ОперацияНПО.Дата = ВыборкаПериод.OPER_DATE - 5;
			ОперацияНПО.Организация=Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО"); 
			ОперацияНПО.Комментарий = ДокументКомментарий;
		    ОперацияНПО.Содержание = ДокументКомментарий;
			ОперацияНПО.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный"); 
			ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
		Иначе
			ОперацияНПО = ОперацияНПОСсылка.ПолучитьОбъект();
		КонецЕсли;

		//запись в регистр уп_НачисленияПенсий
		НаборЗаписей = РегистрыНакопления.уп_НачисленияПенсий.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПО.Ссылка);  
		
		
		Для каждого СтрокаДанных Из ВыборкаПериод.Строки Цикл 
			Если Не ЗначениеЗаполнено(СтрокаДанных.Счет) Тогда
				Продолжить;
			КонецЕсли;
			НоваяЗапись = НаборЗаписей.Добавить();  
			НоваяЗапись.Активность = Истина;   
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход; 
			НоваяЗапись.Период     = ОперацияНПО.Дата;
			НоваяЗапись.НачПериода = СтрокаДанных.oper_begin_o;
			НоваяЗапись.КонПериода = КонецМесяца(СтрокаДанных.oper_begin_o);
			НоваяЗапись.Регистратор = ОперацияНПО.Ссылка;
			НоваяЗапись.НомерСчета = СтрокаДанных.Счет;  
			НоваяЗапись.ДнейВПериоде = День(КонецМесяца(СтрокаДанных.oper_begin_o));
	        НоваяЗапись.Сумма = СтрокаДанных.oper_sum;  
	        НоваяЗапись.Схема = СтрокаДанных.Схема;	
			НоваяЗапись.ТипРезерва =СтрокаДанных.ТипРезерваСписания;
			НоваяЗапись.ТипСуммы =СтрокаДанных.ТипСумм; 
			НоваяЗапись.ТипРезерваНачисления =СтрокаДанных.ТипРезерваСписания;
			НоваяЗапись.НомерСчетаНачисления = СтрокаДанных.СчетИсточник; 
			
		КонецЦикла;
		ТабНачислений = НаборЗаписей.Выгрузить();

		ТабРезервовНПО = Документы.уп_ВозвратПенсий.ДвиженияПоРезервамНПО(ОперацияНПО.Ссылка, ОперацияНПО.Дата, Организация, ТабНачислений, , , Истина);
		
		//запись в регистр уп_Резервы
		НаборЗаписейРезервы = РегистрыНакопления.уп_Резервы.СоздатьНаборЗаписей(); 
		НаборЗаписейРезервы.Отбор.Регистратор.Установить(ОперацияНПО.Ссылка);  

		Для каждого СтрокаРезервов Из ТабРезервовНПО Цикл
			СтрокаРезерыНачислений = НаборЗаписейРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
			СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Приход;
			                                                                     
			СтрокаРезерыНачислений = НаборЗаписейРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
			СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Расход;
			СтрокаРезерыНачислений.ТипРезерва = СтрокаРезервов.ТипРезерваИсх;
		КонецЦикла;
	
		НаборЗаписей.Записать();
		НаборЗаписейРезервы.Записать();		
		ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
	    ДокументОстатков = ОперацияНПО.Ссылка;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выполнена загрузка "+ ДокументКомментарий + " в "+ДокументОстатков;
		Сообщение.КлючДанных = ДокументОстатков;
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

Процедура KU_ДолгПоЗадолженности_ЗагрузитьВРегистр(ДеревоНаСервере,ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	ДокументКомментарий ="Долги по задолженности Каспер";

	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");
	
	Для каждого ВыборкаПериод Из ДеревоНаСервере.Строки Цикл
		
		Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
			ОперацияНПО = Документы.уп_ОперацияНПО.СоздатьДокумент();
		    ОперацияНПО.ВидРучнойОперации=Справочники.уп_ВидыРучныхОперацийНПФ.НайтиПоКоду("000000023"); 
			ОперацияНПО.Дата = ВыборкаПериод.OPER_DATE - 5;
			ОперацияНПО.Организация=Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО"); 
			ОперацияНПО.Комментарий = ДокументКомментарий;
		    ОперацияНПО.Содержание = ДокументКомментарий;
			ОперацияНПО.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный"); 
			ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
		Иначе
			ОперацияНПО = ОперацияНПОСсылка.ПолучитьОбъект();
		КонецЕсли;
				
		НаборЗаписей = РегистрыНакопления.уп_ЗадолженностьПоПенсиям.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПО.Ссылка);  
		
		
		Для каждого СтрокаДанных Из ВыборкаПериод.Строки Цикл 
			Если Не ЗначениеЗаполнено(СтрокаДанных.Счет) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.ДобавитьПриход();  
			НоваяЗапись.Активность = Истина;
			
			НоваяЗапись.Счетчик = 1;
			НоваяЗапись.НомерСчета = СтрокаДанных.Счет;
			НоваяЗапись.Регистратор = ОперацияНПО.Ссылка;
			НоваяЗапись.Период = ОперацияНПО.Дата;
			НоваяЗапись.НачалоПериода = СтрокаДанных.oper_begin;
			НоваяЗапись.КонецПериода = СтрокаДанных.oper_end;
			НоваяЗапись.СуммаПенсии = СтрокаДанных.oper_sum;
			
		КонецЦикла;
		НаборЗаписей.Записать();
		ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
	    ДокументОстатков = ОперацияНПО.Ссылка;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выполнена загрузка "+ ДокументКомментарий + " в "+ДокументОстатков;
		Сообщение.КлючДанных = ДокументОстатков;
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиТДНаФорму(ДеревоНаСервере,ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	//ДополнительныеПараметры.С1_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",
	//			СтрокаТаблицы.ПредставлениеТаблицы +":"+ СтруктураЗагрузкиКлиент.МетаданныеЗначения_Имя + " (" + ПолучитьМетаТип_по_ТипОбъекта(СтрокаТаблицы.ТипОбъекта)+СтрокаТаблицы.ИмяТаблицы+")",СтруктураЗагрузкиКлиент.ТекстЗапроса,СтруктураЗагрузкиКлиент.ТЗ));
	//РезультатЗагрузки.Результат = Истина; 
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура();		
	КонецЕсли;
	
	Если ТипЗнч(ДеревоНаСервере) = Тип("ДеревоЗначений") ИЛИ ТипЗнч(ДеревоНаСервере) = Тип("ТаблицаЗначений") Тогда
		ПострПечать = Новый ПостроительОтчета;
		Если СтрокаПравилСервер.Свойство("ТекстЗапроса") Тогда
			ПострПечать.ТекстЗаголовка = СтрокаПравилСервер.ТекстЗапроса;
	    КонецЕсли;
		ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДеревоНаСервере); 
	    ПострПечать.Выполнить();
	    Для каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
	        Колонка.Представление = ДеревоНаСервере.Колонки[Колонка.Имя].Заголовок;
		КонецЦикла;         
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ПострПечать.Вывести(ТабличныйДокумент);
		СтрокаПравилСервер.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	ИначеЕсли  ТипЗнч(ДеревоНаСервере) = Тип("ТабличныйДокумент") Тогда;
		ТабличныйДокумент = ДеревоНаСервере;
		СтрокаПравилСервер.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	Иначе
		СтрокаПравилСервер.Вставить("ТабличныйДокумент",Новый ТабличныйДокумент);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПечатьДерева(ТабДок,Секция,СтрокаДерева,Уровень = 0,Колонки)
    Для Каждого стр Из СтрокаДерева.Строки Цикл
        НомерКолонки = 0;
        отступ = "";
        Для н = 1 По Уровень Цикл   
            отступ = отступ + " ";
        КонецЦикла;
        Для Каждого КЛ Из Колонки Цикл
            НомерКолонки = НомерКолонки + 1;
            Секция.Область(1, НомерКолонки).Текст = ?(НомерКолонки = 1, отступ+стр[КЛ.Имя], стр[КЛ.Имя]);
        КонецЦикла;
        ТабДок.Вывести(Секция,Уровень+1);
        ПечатьДерева(ТабДок,Секция,стр,Уровень+1,Колонки);
    КонецЦикла;
КонецПроцедуры
